; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_20_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 - counter
	)
  (:init
		(= (value c0) 14)
	(= (value c1) 2)
	(= (value c2) 42)
	(= (value c3) 8)
	(= (value c4) 96)
	(= (value c5) 14)
	(= (value c6) 33)
	(= (value c7) 19)
	(= (value c8) 32)
	(= (value c9) 79)
	(= (value c10) 35)
	(= (value c11) 4)
	(= (value c12) 76)
	(= (value c13) 67)
	(= (value c14) 59)
	(= (value c15) 6)
	(= (value c16) 49)
	(= (value c17) 28)
	(= (value c18) 84)
	(= (value c19) 21)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)
	(= (rate_value c19) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
	(<= (+ (value c18) 1) (value c19))
		)
	)
)

; plan
1. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 8 of 19
2. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 8 of 19
3. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 8 of 19
4. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 8 of 19
5. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 8 of 19
6. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 8 of 19
7. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 8 of 19
8. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 8 of 19
9. (increase_rate c15)
   changed: (rate_value c15) from 5 to 6
   goals met: 8 of 19
10. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 8 of 19
11. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 8 of 19
12. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 19
13. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 19
14. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 19
15. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 19
16. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 19
17. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 8 of 19
18. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 8 of 19
19. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 8 of 19
20. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 8 of 19
21. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 8 of 19
22. (increment c17)
   changed: (value c17) from 28 to 34
   goals met: 8 of 19
23. (increase_rate c17)
   changed: (rate_value c17) from 6 to 7
   goals met: 8 of 19
24. (increment c17)
   changed: (value c17) from 34 to 41
   goals met: 8 of 19
25. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 8 of 19
26. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 8 of 19
27. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 8 of 19
28. (increment c13)
   changed: (value c13) from 67 to 72
   goals met: 8 of 19
29. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 8 of 19
30. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 19
31. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 19
32. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 19
33. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 19
34. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 19
35. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 8 of 19
36. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 8 of 19
37. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 8 of 19
38. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 8 of 19
39. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 8 of 19
40. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 8 of 19
41. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 8 of 19
42. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 8 of 19
43. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 8 of 19
44. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 8 of 19
45. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 19
46. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 19
47. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 8 of 19
48. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 8 of 19
49. (increment c17)
   changed: (value c17) from 41 to 48
   goals met: 8 of 19
50. (increment c17)
   changed: (value c17) from 48 to 55
   goals met: 9 of 19
51. (increment c1)
   changed: (value c1) from 2 to 6
   goals met: 9 of 19
52. (increment c1)
   changed: (value c1) from 6 to 10
   goals met: 9 of 19
53. (increment c1)
   changed: (value c1) from 10 to 14
   goals met: 9 of 19
54. (increment c1)
   changed: (value c1) from 14 to 18
   goals met: 10 of 19
55. (increase_rate c19)
   changed: (rate_value c19) from 0 to 1
   goals met: 10 of 19
56. (increase_rate c19)
   changed: (rate_value c19) from 1 to 2
   goals met: 10 of 19
57. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 10 of 19
58. (increase_rate c19)
   changed: (rate_value c19) from 2 to 3
   goals met: 10 of 19
59. (increase_rate c19)
   changed: (rate_value c19) from 3 to 4
   goals met: 10 of 19
60. (increase_rate c19)
   changed: (rate_value c19) from 4 to 5
   goals met: 10 of 19
61. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 10 of 19
62. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 10 of 19
63. (increase_rate c19)
   changed: (rate_value c19) from 5 to 6
   goals met: 10 of 19
64. (increase_rate c18)
   changed: (rate_value c18) from 3 to 4
   goals met: 10 of 19
65. (increment c19)
   changed: (value c19) from 21 to 27
   goals met: 10 of 19
66. (increment c19)
   changed: (value c19) from 27 to 33
   goals met: 10 of 19
67. (increase_rate c19)
   changed: (rate_value c19) from 6 to 7
   goals met: 10 of 19
68. (increment c19)
   changed: (value c19) from 33 to 40
   goals met: 10 of 19
69. (increment c19)
   changed: (value c19) from 40 to 47
   goals met: 10 of 19
70. (increment c19)
   changed: (value c19) from 47 to 54
   goals met: 10 of 19
71. (increment c19)
   changed: (value c19) from 54 to 61
   goals met: 10 of 19
72. (increment c19)
   changed: (value c19) from 61 to 68
   goals met: 10 of 19
73. (increment c19)
   changed: (value c19) from 68 to 75
   goals met: 10 of 19
74. (increment c19)
   changed: (value c19) from 75 to 82
   goals met: 10 of 19
75. (increment c19)
   changed: (value c19) from 82 to 89
   goals met: 11 of 19
76. (increase_rate c15)
   changed: (rate_value c15) from 6 to 7
   goals met: 11 of 19
77. (increase_rate c15)
   changed: (rate_value c15) from 7 to 8
   goals met: 11 of 19
78. (increment c15)
   changed: (value c15) from 6 to 14
   goals met: 11 of 19
79. (increment c15)
   changed: (value c15) from 14 to 22
   goals met: 11 of 19
80. (increment c15)
   changed: (value c15) from 22 to 30
   goals met: 11 of 19
81. (increment c15)
   changed: (value c15) from 30 to 38
   goals met: 11 of 19
82. (increment c15)
   changed: (value c15) from 38 to 46
   goals met: 11 of 19
83. (increment c15)
   changed: (value c15) from 46 to 54
   goals met: 10 of 19
84. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 10 of 19
85. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 10 of 19
86. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 10 of 19
87. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 10 of 19
88. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 10 of 19
89. (increment c7)
   changed: (value c7) from 19 to 22
   goals met: 10 of 19
90. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 10 of 19
91. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 10 of 19
92. (increment c7)
   changed: (value c7) from 22 to 27
   goals met: 10 of 19
93. (increment c7)
   changed: (value c7) from 27 to 32
   goals met: 9 of 19
94. (decrement c6)
   changed: (value c6) from 33 to 31
   goals met: 10 of 19
95. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 10 of 19
96. (increment c5)
   changed: (value c5) from 14 to 23
   goals met: 10 of 19
97. (increment c5)
   changed: (value c5) from 23 to 32
   goals met: 9 of 19
98. (increment c6)
   changed: (value c6) from 31 to 33
   goals met: 9 of 19
99. (decrement c7)
   changed: (value c7) from 32 to 27
   goals met: 10 of 19
100. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 10 of 19
101. (increment c5)
   changed: (value c5) from 32 to 41
   goals met: 9 of 19
102. (decrement c4)
   changed: (value c4) from 96 to 90
   goals met: 9 of 19
103. (increment c7)
   changed: (value c7) from 27 to 32
   goals met: 8 of 19
104. (decrement c6)
   changed: (value c6) from 33 to 31
   goals met: 9 of 19
105. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 9 of 19
106. (increment c5)
   changed: (value c5) from 41 to 50
   goals met: 9 of 19
107. (decrement c4)
   changed: (value c4) from 90 to 83
   goals met: 9 of 19
108. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 9 of 19
109. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 9 of 19
110. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 9 of 19
111. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 9 of 19
112. (decrement c5)
   changed: (value c5) from 50 to 40
   goals met: 9 of 19
113. (decrement c4)
   changed: (value c4) from 83 to 73
   goals met: 9 of 19
114. (decrement c5)
   changed: (value c5) from 40 to 30
   goals met: 10 of 19
115. (decrement c4)
   changed: (value c4) from 73 to 63
   goals met: 10 of 19
116. (decrement c4)
   changed: (value c4) from 63 to 53
   goals met: 10 of 19
117. (decrement c4)
   changed: (value c4) from 53 to 43
   goals met: 10 of 19
118. (decrement c4)
   changed: (value c4) from 43 to 33
   goals met: 10 of 19
119. (decrement c4)
   changed: (value c4) from 33 to 23
   goals met: 11 of 19
120. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 11 of 19
121. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 11 of 19
122. (increment c3)
   changed: (value c3) from 8 to 15
   goals met: 11 of 19
123. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 11 of 19
124. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 11 of 19
125. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 11 of 19
126. (increment c3)
   changed: (value c3) from 15 to 23
   goals met: 10 of 19
127. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 10 of 19
128. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 10 of 19
129. (increment c3)
   changed: (value c3) from 23 to 33
   goals met: 10 of 19
130. (increment c16)
   changed: (value c16) from 49 to 51
   goals met: 10 of 19
131. (increment c16)
   changed: (value c16) from 51 to 53
   goals met: 10 of 19
132. (increment c15)
   changed: (value c15) from 54 to 62
   goals met: 11 of 19
133. (increment c16)
   changed: (value c16) from 53 to 55
   goals met: 10 of 19
134. (increment c17)
   changed: (value c17) from 55 to 62
   goals met: 11 of 19
135. (decrement c15)
   changed: (value c15) from 62 to 54
   goals met: 11 of 19
136. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 11 of 19
137. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 11 of 19
138. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 11 of 19
139. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 11 of 19
140. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 11 of 19
141. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 11 of 19
142. (increment c14)
   changed: (value c14) from 59 to 61
   goals met: 11 of 19
143. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 11 of 19
144. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 11 of 19
145. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 11 of 19
146. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 11 of 19
147. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 11 of 19
148. (increment c11)
   changed: (value c11) from 4 to 9
   goals met: 11 of 19
149. (increment c11)
   changed: (value c11) from 9 to 14
   goals met: 11 of 19
150. (increment c11)
   changed: (value c11) from 14 to 19
   goals met: 11 of 19
151. (increment c11)
   changed: (value c11) from 19 to 24
   goals met: 11 of 19
152. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 11 of 19
153. (increment c11)
   changed: (value c11) from 24 to 30
   goals met: 11 of 19
154. (increment c11)
   changed: (value c11) from 30 to 36
   goals met: 12 of 19
155. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 12 of 19
156. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 12 of 19
157. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 12 of 19
158. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 12 of 19
159. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 12 of 19
160. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 12 of 19
161. (increment c10)
   changed: (value c10) from 35 to 41
   goals met: 11 of 19
162. (increment c11)
   changed: (value c11) from 36 to 42
   goals met: 12 of 19
163. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 12 of 19
164. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 12 of 19
165. (increment c10)
   changed: (value c10) from 41 to 49
   goals met: 11 of 19
166. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 11 of 19
167. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 11 of 19
168. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 11 of 19
169. (increment c10)
   changed: (value c10) from 49 to 58
   goals met: 11 of 19
170. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 11 of 19
171. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 11 of 19
172. (increment c11)
   changed: (value c11) from 42 to 49
   goals met: 11 of 19
173. (increment c11)
   changed: (value c11) from 49 to 56
   goals met: 11 of 19
174. (increment c11)
   changed: (value c11) from 56 to 63
   goals met: 12 of 19
175. (increment c10)
   changed: (value c10) from 58 to 68
   goals met: 11 of 19
176. (increment c11)
   changed: (value c11) from 63 to 70
   goals met: 12 of 19
177. (decrement c2)
   changed: (value c2) from 42 to 40
   goals met: 12 of 19
178. (decrement c2)
   changed: (value c2) from 40 to 38
   goals met: 12 of 19
179. (decrement c2)
   changed: (value c2) from 38 to 36
   goals met: 12 of 19
180. (decrement c2)
   changed: (value c2) from 36 to 34
   goals met: 12 of 19
181. (decrement c2)
   changed: (value c2) from 34 to 32
   goals met: 13 of 19
182. (increment c15)
   changed: (value c15) from 54 to 62
   goals met: 13 of 19
183. (increment c16)
   changed: (value c16) from 55 to 57
   goals met: 13 of 19
184. (increment c16)
   changed: (value c16) from 57 to 59
   goals met: 13 of 19
185. (increment c16)
   changed: (value c16) from 59 to 61
   goals met: 13 of 19
186. (increment c16)
   changed: (value c16) from 61 to 63
   goals met: 13 of 19
187. (increment c17)
   changed: (value c17) from 62 to 69
   goals met: 14 of 19
188. (increment c10)
   changed: (value c10) from 68 to 78
   goals met: 13 of 19
189. (increment c11)
   changed: (value c11) from 70 to 77
   goals met: 12 of 19
190. (increment c11)
   changed: (value c11) from 77 to 84
   goals met: 13 of 19
191. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 13 of 19
192. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 13 of 19
193. (decrement c9)
   changed: (value c9) from 79 to 77
   goals met: 14 of 19
194. (decrement c11)
   changed: (value c11) from 84 to 75
   goals met: 14 of 19
195. (decrement c10)
   changed: (value c10) from 78 to 68
   goals met: 14 of 19
196. (decrement c9)
   changed: (value c9) from 77 to 75
   goals met: 14 of 19
197. (decrement c9)
   changed: (value c9) from 75 to 73
   goals met: 14 of 19
198. (decrement c9)
   changed: (value c9) from 73 to 71
   goals met: 14 of 19
199. (decrement c9)
   changed: (value c9) from 71 to 69
   goals met: 14 of 19
200. (decrement c9)
   changed: (value c9) from 69 to 67
   goals met: 15 of 19
201. (increment c4)
   changed: (value c4) from 23 to 33
   goals met: 14 of 19
202. (increment c5)
   changed: (value c5) from 30 to 40
   goals met: 14 of 19
203. (increment c6)
   changed: (value c6) from 31 to 33
   goals met: 13 of 19
204. (increment c7)
   changed: (value c7) from 32 to 37
   goals met: 14 of 19
205. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 14 of 19
206. (increment c8)
   changed: (value c8) from 32 to 33
   goals met: 14 of 19
207. (increment c4)
   changed: (value c4) from 33 to 43
   goals met: 14 of 19
208. (decrement c7)
   changed: (value c7) from 37 to 32
   goals met: 14 of 19
209. (decrement c6)
   changed: (value c6) from 33 to 31
   goals met: 15 of 19
210. (decrement c5)
   changed: (value c5) from 40 to 30
   goals met: 16 of 19
211. (increment c13)
   changed: (value c13) from 72 to 82
   goals met: 17 of 19
212. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 17 of 19
213. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 17 of 19
214. (increment c14)
   changed: (value c14) from 61 to 65
   goals met: 16 of 19
215. (increment c15)
   changed: (value c15) from 62 to 70
   goals met: 16 of 19
216. (increment c16)
   changed: (value c16) from 63 to 65
   goals met: 16 of 19
217. (increment c16)
   changed: (value c16) from 65 to 67
   goals met: 16 of 19
218. (increment c16)
   changed: (value c16) from 67 to 69
   goals met: 15 of 19
219. (increment c17)
   changed: (value c17) from 69 to 76
   goals met: 16 of 19
220. (increment c16)
   changed: (value c16) from 69 to 71
   goals met: 17 of 19
221. (increment c14)
   changed: (value c14) from 65 to 69
   goals met: 17 of 19
222. (increment c14)
   changed: (value c14) from 69 to 73
   goals met: 16 of 19
223. (increment c15)
   changed: (value c15) from 70 to 78
   goals met: 16 of 19
224. (increment c16)
   changed: (value c16) from 71 to 73
   goals met: 16 of 19
225. (increment c16)
   changed: (value c16) from 73 to 75
   goals met: 16 of 19
226. (increment c16)
   changed: (value c16) from 75 to 77
   goals met: 15 of 19
227. (increment c17)
   changed: (value c17) from 76 to 83
   goals met: 16 of 19
228. (increment c16)
   changed: (value c16) from 77 to 79
   goals met: 17 of 19
229. (increment c14)
   changed: (value c14) from 73 to 77
   goals met: 17 of 19
230. (increment c14)
   changed: (value c14) from 77 to 81
   goals met: 16 of 19
231. (increment c15)
   changed: (value c15) from 78 to 86
   goals met: 16 of 19
232. (increment c16)
   changed: (value c16) from 79 to 81
   goals met: 16 of 19
233. (increment c16)
   changed: (value c16) from 81 to 83
   goals met: 15 of 19
234. (increment c17)
   changed: (value c17) from 83 to 90
   goals met: 15 of 19
235. (increment c18)
   changed: (value c18) from 84 to 88
   goals met: 15 of 19
236. (increment c18)
   changed: (value c18) from 88 to 92
   goals met: 15 of 19
237. (increment c19)
   changed: (value c19) from 89 to 96
   goals met: 16 of 19
238. (increment c16)
   changed: (value c16) from 83 to 85
   goals met: 16 of 19
239. (increment c16)
   changed: (value c16) from 85 to 87
   goals met: 17 of 19
240. (increment c14)
   changed: (value c14) from 81 to 85
   goals met: 18 of 19
241. (decrement c4)
   changed: (value c4) from 43 to 33
   goals met: 17 of 19
242. (decrement c4)
   changed: (value c4) from 33 to 23
   goals met: 18 of 19
243. (decrement c3)
   changed: (value c3) from 33 to 23
   goals met: 17 of 19
244. (decrement c3)
   changed: (value c3) from 23 to 13
   goals met: 18 of 19
245. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 18 of 19
246. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 18 of 19
247. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 18 of 19
248. (decrement c2)
   changed: (value c2) from 32 to 27
   goals met: 18 of 19
249. (decrement c2)
   changed: (value c2) from 27 to 22
   goals met: 18 of 19
250. (decrement c2)
   changed: (value c2) from 22 to 17
   goals met: 17 of 19
251. (decrement c2)
   changed: (value c2) from 17 to 12
   goals met: 18 of 19
252. (decrement c1)
   changed: (value c1) from 18 to 14
   goals met: 17 of 19
253. (decrement c1)
   changed: (value c1) from 14 to 10
   goals met: 18 of 19
254. (decrement c0)
   changed: (value c0) from 14 to 12
   goals met: 18 of 19
255. (decrement c0)
   changed: (value c0) from 12 to 10
   goals met: 18 of 19
256. (decrement c0)
   changed: (value c0) from 10 to 8
   goals met: 19 of 19
